/************************************************************************************
 * 
 *  @file 
 *  @brief              民俗模块常量定义头文件
 * 
 *  <b>文件名</b>      : ComCustomConstantDef.h
 *  @n@n<b>版权所有</b>: 网龙天晴程序部应用软件开发组
 *  @n@n<b>作  者</b>  : 李学锋
 *  @n@n<b>创建时间</b>: 2010-1-19 15:07:33
 *  @n@n<b>文件描述</b>: 
 *  @version		版本	修改者		  时间		  描述@n
 *  @n		        李学锋        2010-02-25 
 * 
************************************************************************************/
#ifndef _COM_CUSTOM_COMSTANT_DEF_H_
#define _COM_CUSTOM_COMSTANT_DEF_H_

#include <string>

//28星宿的名字
const std::string TweleveShen[28] = {"心月狐宿星","尾火虎宿星","箕水豹宿星","斗木獬宿星", 
"牛金牛宿星","女士蝠宿星","虚日鼠宿星","危月燕宿星", 
"室火猪宿星","璧水偷宿星","奎水狼宿星","娄金狗宿星",
"胃土雉宿星","昴日鸡宿星","毕月乌宿星","觜火猴宿星",  
"参水猿宿星","井木犴宿星","鬼金羊宿星","柳土獐宿星", 
"星日马宿星","张月鹿宿星","翼火蛇宿星","轸水蚓宿星",
"角木蛟宿星","亢金龙宿星","氐土貉宿星","房日鬼宿星"};

//28星宿的解释
const std::string TweleveShenYiJi[28] = {"心星造作大为凶，更遭刑讼狱囚中，忤逆官非宅产退，埋葬卒暴死相从。婚姻若是用此日，子死儿亡泪满胸，三年之内连遭祸，事事教君没始终。",
"尾星造作主天恩，富贵荣华福禄增，招财进宝兴家宅，和合婚姻贵子孙，埋葬若能依此日，男清女正子孙兴，开门放水招田宅，代代公侯远播名。",
"箕星造作主高强，岁岁年年大吉昌，埋葬修坟大吉利，田蚕牛马遍山岗，开门放水招田宅，箧满金银谷满仓，福荫高官加禄位，六亲丰荣乐安康。",
"斗星造作主招财，文武官员位鼎台，田宅家财千万进，坟堂修筑贵富来，开门放水招牛马，旺蚕男女主和谐，遇此吉宿来照护，时支福庆永无灾。",
"牛星造作主灾危，九横三灾不可推，家宅不安人口退，田蚕不利主人衰，嫁娶婚姻皆自损，金银财谷渐无之，若是开门并放水，牛猪羊马亦伤悲。",
"女星造作损婆娘，兄弟相嫌似虎狼，埋葬生灾逢鬼怪，颠邪疾病主瘟惶，为事遭官财失散，泻利留连不可当，开门放水用此日，全家财散主离乡。",
"虚星造作主灾殃，男女孤眠不一双，内乱风声无礼节，儿孙媳妇伴人床，开门放水遭灾祸，虎咬蛇伤又卒亡，三三五五连年病，家破人亡不可当。",
"危星不可造高楼，自遭刑吊见血光，三年孩子遭水厄，后生出外永不还，埋葬若还逢此日，周年百日取高堂，三年两载一悲伤，开门放水到官堂。",
"室星修造进田牛，儿孙代代近王侯，家贵荣华天上至，寿如彭祖八千秋，开门放水招财帛，和合婚姻生贵儿，埋葬若能依此日，门庭兴旺福无休。",
"璧星造作主增财，丝蚕大熟福滔天，奴婢自来人口进，开门放水出英贤，埋葬招财官品进，家中诸事乐陶然，婚姻吉利主贵子，早播名誉着祖鞭。",
"奎星造作得祯祥，家内荣和大吉昌，若是埋葬阴卒死，当年定主两三伤，看看军令刑伤到，重重官事主瘟惶，开门放水遭灾祸，三年两次损儿郎。",
"娄星修造起门庭，财旺家和事事兴，外进钱财百日进，一家兄弟播高名，婚姻进益生贵子，玉帛金银箱满盈，放水开门皆吉利，男荣女贵寿康宁。",
"胃星造作事如何，家贵荣华喜气多，埋葬贵临官禄位，夫妇齐眉永保康，婚姻遇此家富贵，三灾九祸不逢他，从此门前多吉庆，儿孙代代拜金阶。",
"昴星造作进田牛，埋葬官灾不得休，重丧二日三人死，尽卖田园不记增，开门放水招灾祸，三岁孩儿白了头，婚姻不可逢此日，死别生离是可愁。",
"毕星造作主光前，买得田园有余钱，埋葬此日添官职，田蚕大熟永丰年，开门放水多吉庆，合家人口得安然，婚姻若得逢此日，生得孩儿福寿全。",
"觜星造作有徒刑，三年必定主伶丁，埋葬卒死多因此，取定寅年使杀人，三丧不止皆由此，一人药毒二人身，家门田地皆退败，仓库金银化作尘。",
"参星造作旺人家，文星照耀大光华，只因造作田财旺，埋葬招疾哭黄沙，开门放水加官职，房房子孙见田加，婚姻许遁遭刑克，男女朝开幕落花。",
"井星造作旺蚕田，金榜题名第一光，埋葬须防惊卒死，狂颠风疾入黄泉，开门放水招财帛，牛马猪羊旺莫言，贵人田塘来入宅，儿孙兴旺有余钱。",
"鬼星起造卒人亡，堂前不见主人郎，埋葬此日官禄至，儿孙代代近君王，开门放水须伤死，嫁娶夫妻不久长，修土筑墙伤产女，手扶双女泪汪汪。",
"柳星造作主遭官，昼夜偷闭不暂安，埋葬瘟惶多疾病，田园退尽守冬寒，开门放水遭聋瞎，腰佗背曲似弓弯，更有捧刑宜谨慎，妇人随客走盘桓，",
"星宿日好造新房，进职加官近帝王，不可埋葬并放水，凶星临位女人亡，生离死别无心恋，要自归休别嫁郎，孔子九曲殊难度，放水开门天命伤。",
"张星日好造龙轩，年年并见进庄田，埋葬不久升官职，代代为官近帝前，开门放水招财帛，婚姻和合福绵绵，田蚕人满仓库满，百般顺意自安然。",
"翼星不利架高堂，三年二载见瘟惶，埋葬若还逢此日，子孙必定走他乡，婚姻此日不宜利，归家定是不相当，开门放水家须破，少女恋花贪外郎。",
"轸星临水造龙宫，代代为官受皇封，富贵荣华增受禄，库满仓盈自昌隆，埋葬文昌来照助，宅舍安宁不见凶，更有为官沾帝宠，婚姻龙子入龙宫。",
"角星造作主荣昌，外进田财及女郎，嫁娶婚姻出贵子，文人及第见君王，惟有埋葬不可用，三年之后主瘟疫，起工修筑坟基地，当前立见主人凶。",
"亢星造作长房当，十日之中主有殃，田地消磨官失职，接运定是虎狼伤，嫁娶婚姻用此日，儿孙新妇守空房，埋葬若还用此日，当时害祸主重伤。",
"氐星造作主灾凶，费尽田园仓库空，埋葬不可用此日，悬绳吊颈祸重重，若是婚姻离别散，夜招浪子入房中，行船必定遭沉没，更生聋哑子孙穷。",
"房星造作田园进，钱财牛马遍山岗，更招外处田庄宅，荣华富贵福禄康，埋葬若然用此日，高官进职拜君王，嫁娶嫦娥至月殿，三年抱子至朝堂。"};

//彭祖百忌
const std::string PZ[22] = {"甲不开仓","乙不栽植","丙不修灶","丁不剃头","戊不受田","己不破券","庚不经络",
"辛不合酱","壬不决水","癸不词讼","子不问卜","丑不冠带","寅不祭祀","卯不穿井",
"辰不哭泣","巳不远行","午不苫盖","未不服药","申不安床","酉不会客","戌不吃犬","亥不嫁娶"};

//十二建除宜的解释
const std::string TwelveJianChuShenYi[12] = {"出行、上任、会友、上书、见工","除服、疗病、出行、拆卸、入宅",
"祈福、祭祀、结亲、开市、交易","祭祀、涂泥、余事勿取",
"交易、立券、会友、签約、纳畜","祈福、祭祀、求子、结婚、立约",
"日值月破 大事不宜","经营、交易、求官、纳畜、动土",
"祈福、入学、开市、求医、成服","祭祀、求财、签约、嫁娶、订盟",
"疗病、结婚、交易、入仓、求职","祭祀、交易、收财、安葬"};

//十二建除忌的解释
const std::string TwelveJianChuShenJi[12] = {"动土、开仓、嫁娶、纳采","求官、上任、开张、搬家、探病",
"服药、求医、栽种、动土、迁移","移徙、入宅、嫁娶、开市、安葬",
"种植、置业、卖田、掘井、造船","开市、交易、搬家、远行",
"日值月破 大事不宜","登高、行船、安床、入宅、博彩",
"词讼、安门、移徙","开市、安床、安葬、入宅、破土",
"安葬、动土、针灸","宴会、安床、出行、嫁娶、移徙"};

//相冲信息
const std::string TwelveClash[12]= {"冲鼠(子午相冲)","冲牛(丑未相冲)","冲虎(寅申相冲)","冲兔(卯酉相冲)",
"冲龙(辰戌相冲)","冲蛇(巳亥相冲)","冲马(子午相冲)","冲羊(丑未相冲)",
"冲猴(寅申相冲)","冲鸡(卯酉相冲)","冲狗(辰戌相冲)","冲猪(巳亥相冲)"};

const std::string TwelveClash_FT[12]= {"沖鼠(子午相沖)","沖牛(醜未相沖)","沖虎(寅申相沖)","沖兔(卯酉相沖)",
    "沖龍(辰戌相沖)","沖蛇(巳亥相沖)","沖馬(子午相沖)","沖羊(醜未相沖)",
    "沖猴(寅申相沖)","沖雞(卯酉相沖)","沖狗(辰戌相沖)","沖豬(巳亥相沖)"};

// 五行看合适的行业 （依次为：木火土金水）
const std::string WuXingAndCareer[5] = {"可从事木材、木器、家具、装潢、木成品、纸业、种植业、养花业、育树苗、敬神物品、香料、植物性素食品等经营和事业。",
"可从事放光、照明、照光、光学、高热、液热、易烧易燃、油类、酒精类热炊食、食品、理发、化妆品、人身装饰品、文艺、文学、文具、文化学生、文人、作家、写作、教员、校长、秘书、出版、公务、政界等方面的经营和事业。",
"可从事土产、地产、农村、畜牧兽类农人等类、布匹、服装、纺织、石、石灰、山地、水泥、建筑、房产买卖、挡水的雨衣、雨伞、雨帆、筑提、容水物品、当铺、古董、中间人、律师、管理、买卖、设计、顾问、丧业、筑墓、墓地管理、僧尼等工作和经营。",
"可从事精纤材料或金属材料、坚硬、决断、武术、鉴定、清官、总管、汽车、交通、金融、工程、种子、开矿、民意代表、伐木、机械等行业和经营。",
"可从事航海、冷温不燃液体、冰水、鱼类、水产、水利、水物、冷藏、冷冻、打捞、洁洗、扫除、流水、港内、泳池、湖池塘、浴池、冷食物买卖、漂流、奔波、流动、连续性、易变化、属水性质、音响性质、清洁性质、冷温不燃性化学、海上作业、迁旅、特技表演、运动、导游、旅行、玩具、魔术、采访记者、侦探、旅社、灭火器具、医药业、药物经营、医生、护士、占卜等经营和工作。"};


#endif // end of _COM_CUSTOM_COMSTANT_DEF_H_